;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

;; This config is autogenerated. See config.org. ;;

(package! keychain-environment)                                     ; Manage ssh and gpg keys

;; Writing stuff
(unpin! org-roam)
(when (package! org)
  (package! org-appear :recipe (:host github
                                :repo "awth13/org-appear"))         ; Make ** appear on bolded words on hover
  (package! org-auto-tangle)
  (package! org-fragtog)                                            ; Automate inline latex rendering
  (package! org-ref)                                                ; Helps with references
  (when (package! org-roam)
    (package! org-roam-ui :recipe (:host github :repo "org-roam/org-roam-ui" :files ("*.el" "out")))
    (package! org-roam-bibtex)))

(package! academic-phrases)                                         ; Scientific lingo for reports
(package! ivy-bibtex)
(package! orderless)                                                ; Completion backend

(unpin! jupyter) ; Fix jupyter in gccemacs

;; MAIL
(package! mu4e-alert) ; Desktop and emacs notifications when there is new mail

;; (package! evil-colemak
;;   :recipe (:local-repo "~/.dotfiles/doom/.doom.d/packages/evil-colemak/"))
